Repository: eg-abhiyantsingh/iOS_automation_site
Catalog: app-source/Egalvanic PZ/Localizable.xcstrings
Source language: en
Languages: fr

# sessions.attachmentAssetsFooter
source: The attachment will appear in selected assets' attachment list
fr: La pièce jointe apparaîtra dans la liste des pièces jointes des actifs sélectionnés

# sessions.attachments
source: Attachments
fr: Pièces jointes

# sessions.attachmentType
source: Attachment Type
fr: Type de pièce jointe

# sessions.availableWorkOrders
source: Available Work Orders
fr: Ordres de travail disponibles

# sessions.beginCapturing
source: Begin capturing IR photos, issues, and tasks
fr: Commencez à capturer des photos IR, problèmes et tâches

# sessions.browseFiles
source: Browse Files
fr: Parcourir les fichiers

# sessions.byLocation
source: By Location
fr: Par emplacement

# sessions.byParentNode
source: By Parent Node
fr: Par nœud parent

# sessions.cancelUpload
source: Cancel Upload?
fr: Annuler le téléversement ?

# sessions.cancelUploadButton
source: Cancel Upload
fr: Annuler le téléversement

# sessions.changesWillSyncNote
source: Note: Changes will be synced when you're back online.
fr: Note : Les modifications seront synchronisées lorsque vous serez de nouveau en ligne.

# sessions.changesWillSyncWhenOnline
source: Changes will sync when online
fr: Les modifications seront synchronisées en ligne

# sessions.chooseTaskType
source: Choose task type
fr: Choisissez le type de tâche

# sessions.closeSession
source: Close Session
fr: Fermer la session

# sessions.closeSessionDescription
source: This will end the session and prevent new photos from being added. This action cannot be undone.
fr: Ceci terminera la session et empêchera l'ajout de nouvelles photos. Cette action est irréversible.

# sessions.closeSessionTitle
source: Close %@?
fr: Fermer %@ ?

# sessions.closeWorkOrder
source: Close Work Order?
fr: Fermer l'ordre de travail ?

# sessions.closeWorkOrderButton
source: Close Work Order
fr: Fermer l'ordre de travail

# sessions.closeWorkOrderDescription
source: This will end the current work order and prevent new photos from being added to it.
fr: Ceci terminera l'ordre de travail actuel et empêchera l'ajout de nouvelles photos.

# sessions.closingSession
source: Closing session...
fr: Fermeture de la session...

# sessions.closingWorkOrder
source: Closing work order...
fr: Fermeture de l'ordre de travail...

# sessions.collectAFData
source: Collect AF Data
fr: Collecter les données AF

# sessions.collectCOMData
source: Collect COM Data
fr: Collecter les données COM

# sessions.collectData
source: Collect Data
fr: Collecter des données

# sessions.completed
source: Completed
fr: Terminé

# sessions.completedTasks
source: Completed Tasks
fr: Tâches terminées

# sessions.completeTask
source: Complete: %@
fr: Terminer : %@

# sessions.complexTask
source: Complex Task
fr: Tâche complexe

# sessions.continueUpload
source: Continue Upload
fr: Continuer le téléversement

# sessions.createAndLinkAsset
source: Create a new asset and link it to this session:
fr: Créez un nouvel actif et liez-le à cette session :

# sessions.createAssetWithIR
source: Create a new asset with IR photo sets:
fr: Créez un nouvel actif avec des jeux de photos IR :

# sessions.createFirstWorkOrder
source: Create First Work Order
fr: Créer le premier ordre de travail

# sessions.createTask
source: Create Task
fr: Créer une tâche

# sessions.creatingWorkOrder
source: Creating work order...
fr: Création de l'ordre de travail...

# sessions.deleteAttachment
source: Delete Attachment?
fr: Supprimer la pièce jointe ?

# sessions.deleteAttachmentConfirm
source: Are you sure you want to delete this attachment? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer cette pièce jointe ? Cette action est irréversible.

# sessions.deleteIRPhoto
source: Delete IR Photo?
fr: Supprimer la photo IR ?

# sessions.deleteIRPhotoConfirm
source: Are you sure you want to delete this IR photo? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer cette photo IR ? Cette action est irréversible.

# sessions.details
source: Details
fr: Détails

# sessions.editConnections
source: Edit Connections
fr: Modifier les connexions

# sessions.editIRPhoto
source: Edit IR Photo
fr: Modifier la photo IR

# sessions.editOCP
source: Edit OCP
fr: Modifier l'OCP

# sessions.end
source: End
fr: Fin

# sessions.endCurrentFirst
source: End current work order session first
fr: Terminez d'abord la session d'ordre de travail actuelle

# sessions.endSession
source: End Session
fr: Terminer la session

# sessions.endSessionConfirm
source: Are you sure you want to end the '%@' session?
fr: Êtes-vous sûr de vouloir terminer la session « %@ » ?

# sessions.endWorkOrderSession
source: End Work Order Session?
fr: Terminer la session d'ordre de travail ?

# sessions.extractingVisual
source: Extracting visual images from FLIR photos…
fr: Extraction des images visuelles des photos FLIR…

# sessions.extractVisualPhoto
source: Extract Visual Photo
fr: Extraire la photo visuelle

# sessions.extractVisualPhotoFailed
source: Could not extract a visual image from this file
fr: Impossible d'extraire une image visuelle de ce fichier

# sessions.file
source: File
fr: Fichier

# sessions.files
source: Files
fr: Fichiers

# sessions.fileTooLarge
source: File too large. Maximum size is 100MB.
fr: Fichier trop volumineux. Taille maximale : 100 Mo.

# sessions.filteredByAsset
source: Filtered by: %@
fr: Filtré par : %@

# sessions.fromFiles
source: From Files
fr: Depuis les fichiers

# sessions.fromPhotos
source: From Photos
fr: Depuis les photos

# sessions.getStartedIssues
source: Get started by linking existing issues or creating new ones
fr: Commencez en liant des problèmes existants ou en en créant de nouveaux

# sessions.getStartedTasks
source: Get started by linking existing tasks or creating new ones
fr: Commencez en liant des tâches existantes ou en en créant de nouvelles

# sessions.goOnline
source: Go Online
fr: Se connecter

# sessions.incomplete
source: Incomplete
fr: Incomplet

# sessions.irPhotoCountPlural
source: %lld IR Photos
fr: %lld photos IR

# sessions.irPhotoCountSingular
source: %lld IR Photo
fr: %lld photo IR

# sessions.irPhotoFileNameNote
source: File names are used as IR & visual photo keys.
fr: Les noms de fichiers sont utilisés comme clés des photos IR et visuelles.

# sessions.irPhotoFileNameNoteFlirInd
source: File names are used as IR & visual photo keys. For FLIR-IND files, visual photo auto-generates — select from Files only, as Photo Library compresses metadata and is not supported.
fr: Les noms de fichiers sont utilisés comme clés des photos IR et visuelles. Pour les fichiers FLIR-IND, la photo visuelle est générée automatiquement — sélectionnez depuis Fichiers uniquement, car la photothèque compresse les métadonnées et n'est pas prise en charge.

# sessions.irPhotoKey
source: IR Photo Key
fr: Clé de photo IR

# sessions.irPhotoPlural
source: %lld IR photos
fr: %lld photos IR

# sessions.irPhotos
source: IR Photos
fr: Photos IR

# sessions.irPhotoSingular
source: %lld IR photo
fr: %lld photo IR

# sessions.irPhotoType
source: IR Photo Type
fr: Type de photo IR

# sessions.irSessions
source: IR Sessions
fr: Sessions IR

# sessions.issues
source: Issues
fr: Problèmes

# sessions.issuesExclusivityWarning
source: Issues can only be linked to one session at a time
fr: Les problèmes ne peuvent être liés qu'à une seule session à la fois

# sessions.linkedTo
source: Linked to: %@
fr: Lié à : %@

# sessions.linkExistingAsset
source: Link Existing Asset
fr: Lier un actif existant

# sessions.linkExistingAssets
source: Link Existing Assets
fr: Lier des actifs existants

# sessions.linkIssues
source: Link Issues
fr: Lier des problèmes

# sessions.linkTask
source: Link Task
fr: Lier une tâche

# sessions.linkTasks
source: Link Tasks
fr: Lier des tâches

# sessions.linkTasksDescription
source: Link tasks to this session using the button above
fr: Liez des tâches à cette session en utilisant le bouton ci-dessus

# sessions.linkToTask
source: Link this attachment to a specific task
fr: Lier cette pièce jointe à une tâche spécifique

# sessions.listenForAssets
source: Listen for Assets
fr: Écouter les actifs

# sessions.loadingUsers
source: Loading users...
fr: Chargement des utilisateurs...

# sessions.makePublicButton
source: Make Public
fr: Rendre public

# sessions.makePublicMessage
source: This attachment will be visible to clients. Continue?
fr: Cette pièce jointe sera visible par les clients. Continuer ?

# sessions.makePublicTitle
source: Make Public?
fr: Rendre public ?

# sessions.makeVisibility
source: Make %@
fr: Rendre %@

# sessions.manage
source: Manage
fr: Gérer

# sessions.manageIssues
source: Manage Issues
fr: Gérer les problèmes

# sessions.manageTasks
source: Manage Tasks
fr: Gérer les tâches

# sessions.markComplete
source: Mark Complete
fr: Marquer comme terminé

# sessions.markTasksComplete
source: Mark Tasks Complete
fr: Marquer les tâches comme terminées

# sessions.metricArcFlashReadiness
source: Arc Flash Readiness
fr: Préparation arc flash

# sessions.metricChildren
source: Children
fr: Enfants

# sessions.metricInboundConnection
source: Inbound Connection
fr: Connexion entrante

# sessions.metricIRCompletion
source: IR Completion
fr: Complétion IR

# sessions.moreActive
source: + %lld more active
fr: + %lld autres actifs

# sessions.multiNodeTasks
source: Multi-Node Tasks
fr: Tâches multi-nœuds

# sessions.newWorkOrder
source: New Work Order
fr: Nouvel ordre de travail

# sessions.noAssets
source: No Assets
fr: Aucun actif

# sessions.noAttachments
source: No Attachments
fr: Aucune pièce jointe

# sessions.noAvailableAssets
source: No Available Assets
fr: Aucun actif disponible

# sessions.noAvailablePhotos
source: No Available Photos
fr: Aucune photo disponible

# sessions.noEquipmentAvailable
source: No equipment available
fr: Aucun équipement disponible

# sessions.noGrouping
source: No Grouping
fr: Sans regroupement

# sessions.noIRPhotos
source: No IR Photos
fr: Aucune photo IR

# sessions.noIssues
source: No Issues
fr: Aucun problème

# sessions.noIssuesForAsset
source: No issues linked to this asset
fr: Aucun problème lié à cet actif

# sessions.noMatchingAssets
source: No matching assets found in this room
fr: Aucun actif correspondant trouvé dans cette salle

# sessions.noMatchingTasks
source: No Matching Tasks
fr: Aucune tâche correspondante

# sessions.noParentNode
source: No Parent Node
fr: Aucun nœud parent

# sessions.noTasks
source: No Tasks
fr: Aucune tâche

# sessions.noTasksForAsset
source: No tasks linked to this asset
fr: Aucune tâche liée à cet actif

# sessions.noTasksMatch
source: No tasks match "%@"
fr: Aucune tâche ne correspond à « %@ »

# sessions.noWorkOrdersYet
source: No Work Orders Yet
fr: Aucun ordre de travail

# sessions.oneTaskMultipleAssets
source: One task for multiple assets or forms
fr: Une tâche pour plusieurs actifs ou formulaires

# sessions.oneTaskOneAsset
source: One task for one asset
fr: Une tâche pour un actif

# sessions.openIssues
source: Open Issues
fr: Problèmes ouverts

# sessions.pendingTasks
source: Pending Tasks
fr: Tâches en attente

# sessions.photoSetsAcrossAssets
source: %1$lld photo %2$@ across %3$lld %4$@
fr: %1$lld photo %2$@ sur %3$lld %4$@

# sessions.photoType
source: Photo Type
fr: Type de photo

# sessions.photoWalkthrough
source: Photo Walkthrough
fr: Parcours photo

# sessions.quickCount
source: Quick Count
fr: Comptage rapide

# sessions.quickQRAction
source: Quick QR Action
fr: Action QR rapide

# sessions.refreshFailed
source: Refresh Failed
fr: Échec de l'actualisation

# sessions.regenerate
source: Regenerate
fr: Régénérer

# sessions.regenerateDescription
source: This will generate a new report with the latest data. The previous report will be replaced.
fr: Ceci générera un nouveau rapport avec les dernières données. Le rapport précédent sera remplacé.

# sessions.regenerateReport
source: Regenerate Report?
fr: Régénérer le rapport ?

# sessions.removeAssetConfirm
source: Remove this asset from the session?
fr: Retirer cet actif de la session ?

# sessions.removeAssetMessage
source: The asset will remain in your library but won't be linked to this session.
fr: L'actif restera dans votre bibliothèque mais ne sera plus lié à cette session.

# sessions.removeFromSession
source: Remove from Session
fr: Retirer de la session

# sessions.removeFromWorkOrder
source: Remove from Work Order
fr: Retirer de l'ordre de travail

# sessions.removeIRPhotoMessage
source: This will remove the IR photo pair from the session.
fr: Ceci retirera la paire de photos IR de la session.

# sessions.removeIRPhotoSet
source: Remove this IR photo set?
fr: Retirer ce jeu de photos IR ?

# sessions.removePhotoFromSession
source: Remove this photo from the session?
fr: Retirer cette photo de la session ?

# sessions.removePhotoMessage
source: The photo will remain in your library but won't be linked to this session.
fr: La photo restera dans votre bibliothèque mais ne sera plus liée à cette session.

# sessions.removePhotoSet
source: Remove this photo set?
fr: Retirer ce jeu de photos ?

# sessions.reopen
source: Reopen
fr: Rouvrir

# sessions.reopenIssue
source: Reopen: %@
fr: Rouvrir : %@

# sessions.reopenIssues
source: Reopen Issues
fr: Rouvrir les problèmes

# sessions.reporter
source: Back office
fr: Bureau

# sessions.resolve
source: Resolve
fr: Résoudre

# sessions.resolveIssue
source: Resolve: %@
fr: Résoudre : %@

# sessions.resolveIssues
source: Resolve Issues
fr: Résoudre les problèmes

# sessions.role
source: Role
fr: Rôle

# sessions.saveIRPhotos
source: Save IR Photos
fr: Enregistrer les photos IR

# sessions.searchEquipment
source: Search equipment
fr: Rechercher un équipement

# sessions.searchIssues
source: Search issues
fr: Rechercher des problèmes

# sessions.searchTasks
source: Search tasks
fr: Rechercher des tâches

# sessions.searchTasksPlaceholder
source: Search tasks...
fr: Rechercher des tâches...

# sessions.searchUsers
source: Search users...
fr: Rechercher des utilisateurs...

# sessions.selectAssetForIR
source: Select an asset to add IR photo sets to:
fr: Sélectionnez un actif pour ajouter des jeux de photos IR :

# sessions.selectAssets
source: Select Assets
fr: Sélectionner des actifs

# sessions.selectedOfTotal
source: %1$lld of %2$lld selected
fr: %1$lld sur %2$lld sélectionné(s)

# sessions.selectEquipment
source: Select Equipment
fr: Sélectionner l'équipement

# sessions.selectIssuesToLink
source: Select issues to link to this session
fr: Sélectionnez les problèmes à lier à cette session

# sessions.selectTasksToLink
source: Select tasks to link to this session
fr: Sélectionnez les tâches à lier à cette session

# sessions.sessionHasNoTasks
source: This session has no tasks to link
fr: Cette session n'a aucune tâche à lier

# sessions.showAll
source: Show All
fr: Tout afficher

# sessions.showAvailableOnly
source: Show Available Only
fr: Afficher uniquement les disponibles

# sessions.simpleTask
source: Simple Task
fr: Tâche simple

# sessions.start
source: Start
fr: Démarrer

# sessions.started
source: Started
fr: Démarré

# sessions.startFirstWorkOrder
source: Start your first work order
fr: Créez votre premier ordre de travail

# sessions.startNewWorkOrder
source: Start New Work Order
fr: Nouvel ordre de travail

# sessions.startSession
source: Start Session
fr: Démarrer la session

# sessions.startSessionConfirm
source: Start '%@' as the active work order session?
fr: Démarrer « %@ » comme session d'ordre de travail active ?

# sessions.startWorkOrderSession
source: Start Work Order Session?
fr: Démarrer la session d'ordre de travail ?

# sessions.stopListening
source: Stop Listening
fr: Arrêter l'écoute

# sessions.tapPlusToAddAssets
source: Tap the + button to add assets to this room
fr: Appuyez sur le bouton + pour ajouter des actifs à cette salle

# sessions.tapPlusToAddIRPhotos
source: Tap the + button to add IR photo sets to assets
fr: Appuyez sur le bouton + pour ajouter des jeux de photos IR aux actifs

# sessions.tapPlusToLinkAssets
source: Tap the + button to link assets to this session
fr: Appuyez sur le bouton + pour lier des actifs à cette session

# sessions.tasks
source: Tasks
fr: Tâches

# sessions.team
source: Team
fr: Équipe

# sessions.teamMembersOnline
source: Team members can be added when online
fr: Les membres de l'équipe peuvent être ajoutés en ligne

# sessions.totalCount
source: %lld total
fr: %lld au total

# sessions.tryClearingFilter
source: Try clearing the filter to see all tasks
fr: Essayez d'effacer le filtre pour voir toutes les tâches

# sessions.unableToGetCompanyInfo
source: Unable to get company information
fr: Impossible d'obtenir les informations de l'entreprise

# sessions.uncomplete
source: Uncomplete
fr: Annuler la complétion

# sessions.uncompleteTask
source: Uncomplete: %@
fr: Annuler la complétion : %@

# sessions.uncompleteTasks
source: Uncomplete Tasks
fr: Annuler la complétion des tâches

# sessions.unknownParent
source: Unknown Parent
fr: Parent inconnu

# sessions.uploadError
source: Upload Error
fr: Erreur de téléversement

# sessions.uploadFile
source: Upload File
fr: Téléverser un fichier

# sessions.uploading
source: Uploading...
fr: Téléversement...

# sessions.uploadingIRPhotos
source: Uploading IR Photos...
fr: Téléchargement des photos IR...

# sessions.uploadInProgress
source: The upload is in progress. Are you sure you want to cancel?
fr: Le téléversement est en cours. Êtes-vous sûr de vouloir annuler ?

# sessions.uploadIRPhotos
source: Upload IR Photos
fr: Télécharger des photos IR

# sessions.visibility
source: Visibility
fr: Visibilité

# sessions.visibilityFooter
source: Internal files are only visible to team members. Public files may be shared with clients.
fr: Les fichiers internes sont uniquement visibles par les membres de l’équipe. Les fichiers publics peuvent être partagés avec les clients.

# sessions.visibilityInternal
source: Internal
fr: Interne

# sessions.visualPhotoKey
source: Visual Photo Key
fr: Clé de photo visuelle

# sessions.workOrderActiveDescription
source: This work order will remain active until you explicitly close it. All IR photos, issues and tasks added will be associated with this work order.
fr: Cet ordre de travail restera actif jusqu'à ce que vous le fermiez explicitement. Toutes les photos IR, problèmes et tâches ajoutés seront associés à cet ordre de travail.

# sessions.workOrderConfiguration
source: Work Order Configuration
fr: Configuration de l'ordre de travail

# sessions.workOrderDetailsHeader
source: WORK ORDER DETAILS
fr: DÉTAILS DE L'ORDRE DE TRAVAIL

# sessions.workOrderName
source: Work Order: %@
fr: Ordre de travail : %@

# sessions.workOrderNameField
source: Work Order Name
fr: Nom de l'ordre de travail

# sessions.workOrders
source: Work Orders
fr: Ordres de travail

# sessions.workOrderWillBeSynced
source: Work order will be synced when online
fr: L'ordre de travail sera synchronisé en ligne

# settings.about
source: About
fr: À propos

# settings.account
source: Account
fr: Compte

# settings.biometricLogin
source: %@ Login
fr: Connexion %@

# settings.cacheClearedSuccessfully
source: Cache cleared successfully
fr: Cache vidé avec succès

# settings.cacheSize
source: Cache size: %@
fr: Taille du cache : %@

# settings.checkPhotoStorageHealth
source: Check photo storage health
fr: Vérifier l'état du stockage photo

# settings.clearImageCache
source: Clear Image Cache
fr: Vider le cache d'images

# settings.clearImageCacheError
source: Failed to clear image cache
fr: Échec du vidage du cache d'images

# settings.clearImageCacheMessage
source: This will clear all cached images. They will be re-downloaded when needed.
fr: Ceci videra toutes les images en cache. Elles seront retéléchargées au besoin.

# settings.connected
source: Connected
fr: Connecté

# settings.disableBiometric
source: Disable %@?
fr: Désactiver %@ ?

# settings.download
source: Download
fr: Télécharger

# settings.downloadEquipmentLibraryConfirmation
source: Download Equipment Library?
fr: Télécharger la bibliothèque d'équipements ?

# settings.downloadEquipmentLibraryMessage
source: This will download the latest equipment library data. The download may take a few minutes depending on your connection.
fr: Cela téléchargera les dernières données de la bibliothèque d'équipements. Le téléchargement peut prendre quelques minutes selon votre connexion.

# settings.enableBiometric
source: Enable %@
fr: Activer %@

# settings.enterPasswordForBiometric
source: Enter your password to enable %@ for quick login.
fr: Entrez votre mot de passe pour activer %@ pour la connexion rapide.

# settings.enterPasswordToSignIn
source: You will need to enter your email and password to sign in next time.
fr: Vous devrez entrer votre courriel et votre mot de passe pour vous connecter la prochaine fois.

# settings.enterYourPassword
source: Enter your password
fr: Entrez votre mot de passe

# settings.equipmentLibrary
source: Equipment Library
fr: Bibliothèque d'équipements

# settings.goOnlineToDownload
source: Go online to download the equipment library
fr: Connectez-vous pour télécharger la bibliothèque d'équipements

# settings.invalidPassword
source: Invalid password. Please try again.
fr: Mot de passe invalide. Veuillez réessayer.

# settings.language
source: Language
fr: Langue

# settings.lastUpdated
source: Last updated %@
fr: Dernière mise à jour %@

# settings.loadLatestEquipmentLibrary
source: Load Latest Equipment Library
fr: Charger la dernière bibliothèque d'équipements

# settings.loggingOut
source: Logging out...
fr: Déconnexion...

# settings.logoutBlockedSyncing
source: A sync is in progress. Please wait until it finishes.
fr: Une synchronisation est en cours. Veuillez attendre qu'elle se termine.

# settings.logoutConfirmation
source: Logout Confirmation
fr: Confirmation de déconnexion

# settings.logoutError
source: Logout Error
fr: Erreur de déconnexion

# settings.logoutMessage
source: Are you sure you want to logout? You will need to sign in again to access your data.
fr: Êtes-vous sûr de vouloir vous déconnecter ? Vous devrez vous reconnecter pour accéder à vos données.

# settings.logoutRequiresOnline
source: You must be online to log out.
fr: Vous devez être en ligne pour vous déconnecter.

# settings.managePendingSyncOps
source: Manage pending sync operations
fr: Gérer les opérations de synchronisation en attente

# settings.networkMode
source: Network Mode
fr: Mode réseau

# settings.notYetDownloaded
source: Not yet downloaded
fr: Pas encore téléchargé

# settings.offlineMode
source: Offline Mode
fr: Mode hors ligne

# settings.photoStorageDiagnostics
source: Photo Storage Diagnostics
fr: Diagnostics de stockage photo

# settings.security
source: Security
fr: Sécurité

# settings.selectLanguage
source: Select Language
fr: Choisir la langue

# settings.sessionAnalytics
source: Session Analytics
fr: Analytique de session

# settings.sessionRecording
source: Session Recording
fr: Enregistrement de session

# settings.sessionRecordingHint
source: Keeping this off improves performance and reduces battery usage.
fr: Laisser cette option désactivée améliore les performances et réduit la consommation de la batterie.

# settings.sldViewerVersion
source: SLD Viewer Version
fr: Version du visualiseur SLD

# settings.storage
source: Storage
fr: Stockage

# settings.switchLanguageMessage
source: Switch language to %@?
fr: Changer la langue en %@ ?

# settings.syncAndNetwork
source: Sync & Network
fr: Synchronisation et réseau

# settings.syncing
source: Syncing...
fr: Synchronisation...

# settings.syncPendingNote
source: %1$lld %2$@ still queued. They will sync after you log back in.
fr: %1$lld %2$@ toujours en file d'attente. Elles se synchroniseront à votre prochaine connexion.
